/*
    バイオハザード 2
    Resident Evil 2
    bio2 1.10.exe
*/

#pragma once

#pragma pack(push, 1)

struct MATRIX {
    SHORT m[3][3];
    LONG t[3];
};

struct VECTOR {
    LONG vx;
    LONG vy;
    LONG vz;
    LONG pad;
};

struct SVECTOR {
    SHORT vx;
    SHORT vy;
    SHORT vz;
    SHORT pad;
};

struct POLY_FT4 {
    ULONG tag;
    UCHAR r0;
    UCHAR g0;
    UCHAR b0;
    UCHAR code;
    SHORT x0;
    SHORT y0;
    UCHAR u0;
    UCHAR v0;
    USHORT clut;
    SHORT x1;
    SHORT y1;
    UCHAR u1;
    UCHAR v1;
    USHORT tpage;
    SHORT x2;
    SHORT y2;
    UCHAR u2;
    UCHAR v2;
    USHORT pad1;
    SHORT x3;
    SHORT y3;
    UCHAR u3;
    UCHAR v3;
    USHORT pad2;
};

struct POLY_GT4 {
    ULONG tag;
    UCHAR r0;
    UCHAR g0;
    UCHAR b0;
    UCHAR code;
    SHORT x0;
    SHORT y0;
    UCHAR u0;
    UCHAR v0;
    USHORT clut;
    UCHAR r1;
    UCHAR g1;
    UCHAR b1;
    UCHAR p1;
    SHORT x1;
    SHORT y1;
    UCHAR u1;
    UCHAR v1;
    USHORT tpage;
    UCHAR r2;
    UCHAR g2;
    UCHAR b2;
    UCHAR p2;
    SHORT x2;
    SHORT y2;
    UCHAR u2;
    UCHAR v2;
    USHORT pad2;
    UCHAR r3;
    UCHAR g3;
    UCHAR b3;
    UCHAR p3;
    SHORT x3;
    SHORT y3;
    UCHAR u3;
    UCHAR v3;
    USHORT pad3;
};

struct SPRT {
    ULONG tag;
    UCHAR r0;
    UCHAR g0;
    UCHAR b0;
    UCHAR code;
    SHORT x0;
    SHORT y0;
    UCHAR u0;
    UCHAR v0;
    USHORT clut;
    SHORT w;
    SHORT h;
};

struct SPRT_8 {
    ULONG tag;
    UCHAR r0;
    UCHAR g0;
    UCHAR b0;
    UCHAR code;
    SHORT x0;
    SHORT y0;
    UCHAR u0;
    UCHAR v0;
    USHORT clut;
};

struct DR_MODE {
    ULONG tag;
    ULONG code[2];
};

struct DR_MOVE {
    ULONG tag;
    ULONG code[5];
};

struct TILE {
    ULONG tag;
    UCHAR r0;
    UCHAR g0;
    UCHAR b0;
    UCHAR code;
    SHORT x0;
    SHORT y0;
    SHORT w;
    SHORT h;
};

struct DR_ENV {
    ULONG tag;
    ULONG code[15];
};

struct RECT16 {
    SHORT x;
    SHORT y;
    SHORT w;
    SHORT h;
};

struct DRAWENV {
    RECT16 clip;
    SHORT ofs[2];
    RECT16 tw;
    USHORT tpage;
    UCHAR dtd;
    UCHAR dfe;
    UCHAR isbg;
    UCHAR r0;
    UCHAR g0;
    UCHAR b0;
    DR_ENV dr_env;
};

struct DISPENV {
    RECT16 disp;
    RECT16 screen;
    UCHAR isinter;
    UCHAR isrgb24;
    UCHAR pad0;
    UCHAR pad1;
};

struct DBUF {
    DRAWENV Draw;
    DISPENV Disp;
    DR_MODE Curtain_Dm;
    DR_MODE Pause_Dm;
    TILE Bg_clr;
};

struct BOX {
    SHORT X;
    SHORT Z;
    USHORT W;
    USHORT D;
};

struct SCE_AOT {
    UCHAR Id;
    UCHAR Type;
    UCHAR nFloor;
    UCHAR Super;
    SHORT X;
    SHORT Z;
    USHORT W;
    USHORT D;
};

struct EM_BIN_INFO {
    USHORT Id;
    USHORT Use;
};

struct IN_DOOR_WORK {
    SHORT Next_pos_x;
    SHORT Next_pos_y;
    SHORT Next_pos_z;
    SHORT Next_cdir_y;
    UCHAR Next_stage;
    UCHAR Next_room;
    UCHAR Next_cut;
    UCHAR Next_nfloor;
    UCHAR Dtex_type;
    UCHAR Door_type;
    UCHAR Knock_type;
    UCHAR Key_id;
    UCHAR Key_type;
    UCHAR Free;
};

struct ITEM_WORK {
    UCHAR Id;
    UCHAR Num;
    UCHAR Size;
    UCHAR dummy;
};

struct AT_DATA {
    LONG X;
    LONG Y;
    LONG Z;
    USHORT W;
    USHORT D;
    SHORT Ofs_x;
    SHORT Ofs_z;
    SHORT Ofs_y;
    USHORT At_w;
    USHORT At_d;
    USHORT At_h;
    SHORT Atw_x;
    SHORT Atw_z;
};

struct BRANCH_TBL {
    UCHAR Select_num;
    UCHAR Mess_ofs;
    UCHAR Skip_size;
    UCHAR Home_pos;
    USHORT Str_no;
};

struct _struct_8 {
    unsigned shape : 4;
    unsigned unk0 : 4;	// 0x00 = Weapon Collision OFF (Desk, etc)
                    // 0x08 = Weapon Collision ON (Wall, etc)
    unsigned unk1 : 1;	// 0x00 = nFloor Height OFF (Cannot Walk Under)
                    // 0x01 = nFloor Height ON (Can Walk Under)
    unsigned unk2 : 1;	// 0x00 = 
                    // 0x01 = 
    unsigned unk3 : 1;	// 0x00 = Enemy Collision OFF
                    // 0x01 = Enemy Collision ON
    unsigned unk4 : 1;	// 0x00 = 
                    // 0x01 = 
    unsigned unk5 : 1;	// 0x00 = 
                    // 0x01 = 
    unsigned unk6 : 1;	// 0x00 = Bullet Collision OFF
                    // 0x01 = Bullet Collision ON
    unsigned unk7 : 1;	// 0x00 = Object Collision OFF
                    // 0x01 = Object Collision ON
    unsigned unk8 : 1;	// 0x00 = Player Collision OFF
                    // 0x01 = Player Collision ON
};

union uId {
    USHORT Id;
    struct _struct_8 s;
};

struct _struct_10 {
    unsigned h : 2;		// Width Multiplier X/W (0-3)
    unsigned y : 2;		// Depth Multiplier Z/D (0-3)
                                    // These values seem to determine if the
                                    // W/D values match or exceed the necessary
                                    // requirements for actual collision, where
                                    // the player comes into contact with said
                                    // collision data.
    unsigned Type : 2;	// Stair/Slope/Platform Access
                                    // 00	Climb/Ascend/Jump down from Z-Axis
                                    // 01	Climb/Ascend/Jump up from Z-Axis
                                    // 02	Climb/Ascend/Jump down from X-Axis
